## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 3 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                          NAME                          |
|----------|--------------------------------------------------------|
| add      | `aws_security_group_rule.database_ingress_ecs`         |
| delete   | `aws_ecs_cluster.saas_procurement`                     |
| update   | `aws_security_group.ecs_tasks`                         |
|          | `module.saas_procurement.aws_ecs_cluster.this[0]`      |
|          | `module.saas_procurement.aws_ecs_service.this`         |
| recreate | `module.saas_procurement.aws_ecs_task_definition.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_cluster.saas_procurement will be destroyed
  # (because aws_ecs_cluster.saas_procurement is not in configuration)
  - resource "aws_ecs_cluster" "saas_procurement" {
      - arn                = "arn:aws:ecs:ca-central-1:394954348146:cluster/saas-procurement-cluster" -> null
      - capacity_providers = [
          - "FARGATE",
        ] -> null
      - id                 = "arn:aws:ecs:ca-central-1:394954348146:cluster/saas-procurement-cluster" -> null
      - name               = "saas-procurement-cluster" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null

      - default_capacity_provider_strategy {
          - base              = 1 -> null
          - capacity_provider = "FARGATE" -> null
          - weight            = 1 -> null
        }

      - setting {
          - name  = "containerInsights" -> null
          - value = "enabled" -> null
        }
    }

  # aws_security_group.ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "Allow ECS to talk to the RDS cluster"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-051638cd60aef88c3",
                ]
              - self             = false
              - to_port          = 5432
            },
            # (1 unchanged element hidden)
        ]
        id                     = "sg-0d1ca7e7e561a219f"
        name                   = "saas-procurement-security-group"
        tags                   = {
            "CostCentre" = "saas-procurement"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_security_group_rule.database_ingress_ecs will be created
  + resource "aws_security_group_rule" "database_ingress_ecs" {
      + description              = "Allow RDS cluster to receive requests from ECS"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-051638cd60aef88c3"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0d1ca7e7e561a219f"
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.saas_procurement.aws_ecs_cluster.this[0] will be updated in-place
  ~ resource "aws_ecs_cluster" "this" {
        id                 = "arn:aws:ecs:ca-central-1:394954348146:cluster/saas-procurement-cluster"
        name               = "saas-procurement-cluster"
      ~ tags               = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
      ~ tags_all           = {
          + "CostCentre" = "saas-procurement"
          + "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.saas_procurement.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:394954348146:service/saas-procurement-cluster/saas-procurement-app-service"
        name                               = "saas-procurement-app-service"
        tags                               = {
            "CostCentre" = "saas-procurement"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:394954348146:task-definition/saas-procurement-task:18" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.saas_procurement.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:394954348146:task-definition/saas-procurement-task:18" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:394954348146:task-definition/saas-procurement-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  - environment            = []
                  - essential              = true
                  - mountPoints            = []
                    name                   = "saas-procurement"
                  ~ readonlyRootFilesystem = true -> false
                  - volumesFrom            = []
                    # (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "saas-procurement-task" -> (known after apply)
      ~ revision                 = 18 -> (known after apply)
        tags                     = {
            "CostCentre" = "saas-procurement"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]

22 tests, 17 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
